In [1]:
import pandas as pd

In [2]:
alunos = {'Nome':['Luiza', 'Maria', 'Joana'], 
          'Matricula':['001','002','003'], 
          'Nota':[9, 8, 4.5]}

#trandformar dicionario em dataframe
alunos_df = pd.DataFrame(alunos)

In [3]:
print(alunos_df)

    Nome Matricula  Nota
0  Luiza       001   9.0
1  Maria       002   8.0
2  Joana       003   4.5

In [4]:
display(alunos_df)

    Nome Matricula  Nota
0  Luiza       001   9.0
1  Maria       002   8.0
2  Joana       003   4.5